Tekla Open API Reference for Tekla Structures 2025
SurfacingAttributes Constructor
Overload List
Name | Description
Surfacing.SurfacingAttributes()
 Creates a new default surfacing attributes instance that loads standard attributes.
Surfacing.SurfacingAttributes(String)
 Creates a new surfacing attributes instance that loads the specified attributes.
Top
See Also
Reference
Surfacing.SurfacingAttributes Class
Tekla.Structures.Drawing Namespace